src/app/controllers/attendances_controller.rb

  def create
    @attendance = @session.attendances.build
    @attendance.participant = current_participant
    if @attendance.save
---
INSERT INTO "attendances" ("created_at", "participant_id", "session_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 03 Sep 2014 21:27:10 CDT -05:00], ["participant_id", 10], ["session_id", 5], ["updated_at", Wed, 03 Sep 2014 21:27:10 CDT -05:00]]
INSERT INTO "participants" ("bio", "created_at", "crypted_password", "email", "name", "persistence_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"