src/app/controllers/participants_controller.rb

INSERT INTO "participants" ("bio", "created_at", "crypted_password", "email", "name", "persistence_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @participant.attributes = participant_params
    if @participant.save