src/app/controllers/presentations_controller.rb

  def create
    begin
      participant = if participant_params[:id].present?
        Participant.find(participant_params[:id])
      elsif participant_params[:name].present?
        participant = Participant.where(name: participant_params[:name])&.first
      end

      if participant.nil?
        message = participant_params[:name] ?
          "Sorry, no presenter matching '#{participant_params[:name]}' was found. Please try again." :
          "Sorry, no presenter was found. Please try again."
        flash[:error] = message
        redirect_to session_presentations_path(@session)
        return
      elsif participant.signed_code_of_conduct_for_current_event? == false
        flash[:error] = "Sorry, #{participant.name} hasn't signed the current Code of Conduct."
        redirect_to session_presentations_path(@session)
        return
      end

      presentation = @session.presentations.new
      presentation.participant = participant

      if presentation.save
---
SELECT "participants".* FROM "participants" WHERE "participants"."name" = 'Joe Schmoe' LIMIT 1
INSERT INTO "presentations" ("created_at", "participant_id", "session_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 03 Sep 2014 21:27:13 CDT -05:00], ["participant_id", 17], ["session_id", 17], ["updated_at", Wed, 03 Sep 2014 21:27:13 CDT -05:00]]