src/app/controllers/schedules_controller.rb

SELECT "events".* FROM "events" ORDER BY date DESC LIMIT 1
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN (20) ORDER BY capacity desc
SELECT "timeslots".* FROM "timeslots" WHERE "timeslots"."id" IN (16) ORDER BY starts_at asc
---
  def ical
    event = Event.current_event

    sessions = event.sessions.includes([:room, :timeslot])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN (30) ORDER BY capacity desc
SELECT "events".* FROM "events" ORDER BY date DESC LIMIT 1
SELECT "timeslots".* FROM "timeslots" WHERE "timeslots"."event_id" IN (1) ORDER BY starts_at asc
---
  def load_event
    event = Event.includes(timeslots: { sessions: [:room, :presenters] }).find(Event.current_event.id)

    # Preload vote counts in order to sort sessions by popularity
    Session.preload_attendance_counts(
      event.timeslots.map(&:sessions).flatten)