src/app/controllers/admin/sessions_controller.rb

INSERT INTO "participants" ("bio", "created_at", "crypted_password", "email", "name", "persistence_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @session.participant = build_presenter
    @session.attributes = session_params
    @session.event = Event.current_event
    @session.timeslot_id = params[:session][:timeslot_id]
    @session.room_id = params[:session][:room_id]

    if @session.save

SELECT "events".* FROM "events" ORDER BY date DESC LIMIT 1
---
  def load_sessions
    @sessions ||= Event.current_event.sessions.includes(:timeslot).order('timeslots.starts_at asc')