src/app/views/schedules/index.html.haml

SELECT "timeslots".* FROM "timeslots" WHERE "timeslots"."event_id" IN (1) ORDER BY starts_at asc
---
  .timeslots
    - @event.timeslots.each do |slot|